<a href="https://colab.research.google.com/github/madhavjk/DataScience-ML_and_DL/blob/main/Session_8_(Pandas).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# pandas
pandas contains data structures and data manipulation tools designed to make data analysis and cleaning fast and easy in python. It has two data structures : 1.Series and 2.DataFrame
#### Datatypes : int64, float64, object, bool, datetime64, timedelta, category

# 1.SERIES

In [ ]:
import pandas as pd

In [ ]:
data = [1,2,3,4]
s1 = pd.Series(data)
s1

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
s1.values

array([1, 2, 3, 4], dtype=int64)

In [ ]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
s1.index = ['a','b','c','d']

In [ ]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
s1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
s1[0]

1

In [ ]:
s1['a']

1

In [ ]:
s1.iloc[2]

3

In [ ]:
s1.loc['c']

3

In [ ]:
s1['e'] = 5
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
s1.loc['f'] = 6
s1

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [ ]:
s1.loc

In [ ]:
1 in s1.values

True

In [ ]:
7 in s1.values

False

In [ ]:
'c' in s1.index

True

In [ ]:
'x' in s1.index

False

In [ ]:
s1[1:5]

b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
data = {'Jaipur' : 'Rajasthan',
       'Mumbai' : 'Maharashtra',
       'Kolkata' : 'West Bengal',
       'Bangaluru' : 'Karnataka',
       'Chandigarh' : 'Punjab'}

s2 = pd.Series(data)
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bangaluru       Karnataka
Chandigarh         Punjab
dtype: object

In [ ]:
s2.name = 'States'

In [ ]:
s2.index.name = 'Capital'

In [ ]:
s2

Capital
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bangaluru       Karnataka
Chandigarh         Punjab
Name: States, dtype: object

In [ ]:
s2['Mumbai']

'Maharashtra'

In [ ]:
s2[['Jaipur','Kolkata', 'Chandigarh']]

Capital
Jaipur          Rajasthan
Kolkata       West Bengal
Chandigarh         Punjab
Name: States, dtype: object

In [ ]:
capitals = ['Jaipur','Kolkata', 'Chandigarh']
s3 = pd.Series(data, index = capitals)
s3

Jaipur          Rajasthan
Kolkata       West Bengal
Chandigarh         Punjab
dtype: object

In [ ]:
s3.isnull()

Jaipur        False
Kolkata       False
Chandigarh    False
dtype: bool

In [ ]:
capitals2 = ['Jaipur','Kolkata', 'Chandigarh','Dehli']
s4 = pd.Series(data, index = capitals2)
s4

Jaipur          Rajasthan
Kolkata       West Bengal
Chandigarh         Punjab
Dehli                 NaN
dtype: object

In [ ]:
s4.isnull()

Jaipur        False
Kolkata       False
Chandigarh    False
Dehli          True
dtype: bool

In [ ]:
s4.notnull()

Jaipur         True
Kolkata        True
Chandigarh     True
Dehli         False
dtype: bool

In [ ]:
s = pd.Series(['India','Australia','England'], index = ['Cricket','Cricket','Cricket'])
s

Cricket        India
Cricket    Australia
Cricket      England
dtype: object

In [ ]:
s.loc['Cricket']

Cricket        India
Cricket    Australia
Cricket      England
dtype: object

In [ ]:
colors = ['Blue', 'Red', None]
pd.Series(colors)

0    Blue
1     Red
2    None
dtype: object

In [ ]:
numbers = [1,2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

# DATAFRAME

In [ ]:
student1 = pd.Series({'Name' : 'Utkarsh',
                     'Id' : 1})
student2 = pd.Series({'Name' : 'Amit',
                     'Id' : 2})
student3 = pd.Series({'Name' : 'Ankit',
                     'Id' : 3})

In [ ]:
df1 = pd.DataFrame([student1,student2,student3], index = (101,102,103))

In [ ]:
df1

        Name  Id
101  Utkarsh   1
102     Amit   2
103    Ankit   3

In [ ]:
data = {'Name' : ['Utkarsh', 'Amit', 'Ankit'],
       'ID' : [1,2,3]}
df2 = pd.DataFrame(data, index = [101,102,103])
df2

        Name  ID
101  Utkarsh   1
102     Amit   2
103    Ankit   3

In [ ]:
df2.head()

        Name  ID
101  Utkarsh   1
102     Amit   2
103    Ankit   3

In [ ]:
df3 = pd.DataFrame(data, index = [101,102,103], columns = ['Name','ID','Age'])
df3

        Name  ID  Age
101  Utkarsh   1  NaN
102     Amit   2  NaN
103    Ankit   3  NaN

In [ ]:
df3.Age = 25

In [ ]:
df3

        Name  ID  Age
101  Utkarsh   1   25
102     Amit   2   25
103    Ankit   3   25

In [ ]:
df3.index

Int64Index([101, 102, 103], dtype='int64')

In [ ]:
df3.values

array([['Utkarsh', 1, 25],
       ['Amit', 2, 25],
       ['Ankit', 3, 25]], dtype=object)

In [ ]:
df3.columns

Index(['Name', 'ID', 'Age'], dtype='object')

In [ ]:
df3['Name']

101    Utkarsh
102       Amit
103      Ankit
Name: Name, dtype: object

In [ ]:
df3.Name

101    Utkarsh
102       Amit
103      Ankit
Name: Name, dtype: object

In [ ]:
df3.iloc[0]

Name    Utkarsh
ID            1
Age          25
Name: 101, dtype: object

In [ ]:
df3.loc[101]

Name    Utkarsh
ID            1
Age          25
Name: 101, dtype: object

In [ ]:
df3.loc[104] = ['Akash',4,23]

In [ ]:
df3

        Name  ID  Age
101  Utkarsh   1   25
102     Amit   2   25
103    Ankit   3   25
104    Akash   4   23

In [ ]:
df3.loc[102]['Name']

'Amit'

In [ ]:
df3['Age'][102] = 26

C:\Users\Utkarsh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df3

        Name  ID  Age
101  Utkarsh   1   25
102     Amit   2   26
103    Ankit   3   25
104    Akash   4   23

In [ ]:
val = pd.Series([21,23,25,24], index = [101,102,103,104])
df3['Age'] = val
df3

        Name  ID  Age
101  Utkarsh   1   21
102     Amit   2   23
103    Ankit   3   25
104    Akash   4   24

In [ ]:
val2 = pd.Series([6,5], index = [101,103])
df3['Height'] = val2
df3

        Name  ID  Age  Height
101  Utkarsh   1   21     6.0
102     Amit   2   23     NaN
103    Ankit   3   25     5.0
104    Akash   4   24     NaN

In [ ]:
df3['Weight'] = df3.Age
df3

        Name  ID  Age  Height  Weight
101  Utkarsh   1   21     6.0      21
102     Amit   2   23     NaN      23
103    Ankit   3   25     5.0      25
104    Akash   4   24     NaN      24

In [ ]:
df3.drop(103)

        Name  ID  Age  Height  Weight
101  Utkarsh   1   21     6.0      21
102     Amit   2   23     NaN      23
104    Akash   4   24     NaN      24

In [ ]:
df3

        Name  ID  Age  Height
101  Utkarsh   1   21     6.0
102     Amit   2   23     NaN
103    Ankit   3   25     5.0
104    Akash   4   24     NaN

In [ ]:
del df3['Weight']

In [ ]:
df3

        Name  ID  Age  Height
101  Utkarsh   1   21     6.0
102     Amit   2   23     NaN
103    Ankit   3   25     5.0
104    Akash   4   24     NaN

In [ ]:
df3.T

            101   102    103    104
Name    Utkarsh  Amit  Ankit  Akash
ID            1     2      3      4
Age          21    23     25     24
Height        6   NaN      5    NaN

In [ ]:
df3.index.name = 'Students'
df3.columns.name = 'Details'
df3

Details      Name  ID  Age  Height
Students
101       Utkarsh   1   21     6.0
102          Amit   2   23     NaN
103         Ankit   3   25     5.0
104         Akash   4   24     NaN

In [ ]:
index = df3.index

In [ ]:
index[1] = 'A'

TypeError: Index does not support mutable operations

In [ ]:
df4 = df3.reindex([201,202,203,204])
df4

Details  Name  ID  Age  Height
Students
201       NaN NaN  NaN     NaN
202       NaN NaN  NaN     NaN
203       NaN NaN  NaN     NaN
204       NaN NaN  NaN     NaN

In [ ]:
df3.dropna()

Details      Name  ID  Age  Height
Students
101       Utkarsh   1   21     6.0
103         Ankit   3   25     5.0

In [ ]:
df3.fillna(0)

Details      Name  ID  Age  Height
Students
101       Utkarsh   1   21     6.0
102          Amit   2   23     0.0
103         Ankit   3   25     5.0
104         Akash   4   24     0.0

In [ ]:
df3.set_index(['Name'])

Details  ID  Age  Height
Name
Utkarsh   1   21     6.0
Amit      2   23     NaN
Ankit     3   25     5.0
Akash     4   24     NaN

In [ ]:
df3.reset_index()

Details  Students     Name  ID  Age  Height
0             101  Utkarsh   1   21     6.0
1             102     Amit   2   23     NaN
2             103    Ankit   3   25     5.0
3             104    Akash   4   24     NaN

## Index a dataframe

In [ ]:
df3['Name']

Students
101    Utkarsh
102       Amit
103      Ankit
104      Akash
Name: Name, dtype: object

In [ ]:
df3[['Name','Age']]

Details      Name  Age
Students
101       Utkarsh   21
102          Amit   23
103         Ankit   25
104         Akash   24

In [ ]:
df3.loc[102]

Details
Name      Amit
ID           2
Age         23
Height     NaN
Name: 102, dtype: object

In [ ]:
df3.loc[[101,103]]

Details      Name  ID  Age  Height
Students
101       Utkarsh   1   21     6.0
103         Ankit   3   25     5.0

In [ ]:
df3.loc[[101,103],['Name','Age']]

Details      Name  Age
Students
101       Utkarsh   21
103         Ankit   25

In [ ]:
df3.iloc[3]

Details
Name      Akash
ID            4
Age          24
Height      NaN
Name: 104, dtype: object

In [ ]:
df3.loc[:,['Name','Age']]

Details      Name  Age
Students
101       Utkarsh   21
102          Amit   23
103         Ankit   25
104         Akash   24

In [ ]:
df3.sort_index()

Details      Name  ID  Age  Height
Students
101       Utkarsh   1   21     6.0
102          Amit   2   23     NaN
103         Ankit   3   25     5.0
104         Akash   4   24     NaN

In [ ]:
df3.sort_values(by = 'Name')

Details      Name  ID  Age  Height
Students
104         Akash   4   24     NaN
102          Amit   2   23     NaN
103         Ankit   3   25     5.0
101       Utkarsh   1   21     6.0

In [ ]:
df3['Name'].unique()

array(['Utkarsh', 'Amit', 'Ankit', 'Akash'], dtype=object)

## Descriptive Statistics

In [ ]:
import numpy as np
data = {'A' : np.arange(11,21),
     'B' : np.arange(21,31),
     'C' : np.arange(31,41)}
df = pd.DataFrame(data)
df

    A   B   C
0  11  21  31
1  12  22  32
2  13  23  33
3  14  24  34
4  15  25  35
5  16  26  36
6  17  27  37
7  18  28  38
8  19  29  39
9  20  30  40

In [ ]:
df.sum()

A    155
B    255
C    355
dtype: int64

In [ ]:
df.sum(axis=1)

0    63
1    66
2    69
3    72
4    75
5    78
6    81
7    84
8    87
9    90
dtype: int64

In [ ]:
df.mean()

A    15.5
B    25.5
C    35.5
dtype: float64

In [ ]:
df.mean(axis=1)

0    21.0
1    22.0
2    23.0
3    24.0
4    25.0
5    26.0
6    27.0
7    28.0
8    29.0
9    30.0
dtype: float64

In [ ]:
df.mean(skipna=True)

A    15.5
B    25.5
C    35.5
dtype: float64

In [ ]:
df.min()

A    11
B    21
C    31
dtype: int32

In [ ]:
df.max()

A    20
B    30
C    40
dtype: int32

In [ ]:
df.var()

A    9.166667
B    9.166667
C    9.166667
dtype: float64

In [ ]:
df.std()

A    3.02765
B    3.02765
C    3.02765
dtype: float64

In [ ]:
df.median()

A    15.5
B    25.5
C    35.5
dtype: float64

In [ ]:
df.describe()

              A         B         C
count  10.00000  10.00000  10.00000
mean   15.50000  25.50000  35.50000
std     3.02765   3.02765   3.02765
min    11.00000  21.00000  31.00000
25%    13.25000  23.25000  33.25000
50%    15.50000  25.50000  35.50000
75%    17.75000  27.75000  37.75000
max    20.00000  30.00000  40.00000

In [ ]:
df.describe().T

   count  mean      std   min    25%   50%    75%   max
A   10.0  15.5  3.02765  11.0  13.25  15.5  17.75  20.0
B   10.0  25.5  3.02765  21.0  23.25  25.5  27.75  30.0
C   10.0  35.5  3.02765  31.0  33.25  35.5  37.75  40.0